In [1]:

# Sample dataset
data = {
    "Customer_Name": ["Ali","Mariam","Usman","Tom","Sana","Ali","Mariam","Usman","Tom","Sana"],
    "City": ["Karachi","Lahore","Multan","Islamabad","Karachi","Lahore","Multan","Islamabad","Karachi","Lahore"],
    "Product": ["Laptop","Mobile","Keyboard","Charger","Smart Watch","Laptop","Mobile","Keyboard","Charger","Smart Watch"],
    "Quantity": [2,1,3,1,2,1,2,1,3,1],
    "Price": [1200,300,30,10,80,1200,300,30,10,80],
}

In [3]:
import pandas as pd
import numpy as np 
df = pd.DataFrame(data)

In [4]:
df

  Customer_Name       City      Product  Quantity  Price
0           Ali    Karachi       Laptop         2   1200
1        Mariam     Lahore       Mobile         1    300
2         Usman     Multan     Keyboard         3     30
3           Tom  Islamabad      Charger         1     10
4          Sana    Karachi  Smart Watch         2     80
5           Ali     Lahore       Laptop         1   1200
6        Mariam     Multan       Mobile         2    300
7         Usman  Islamabad     Keyboard         1     30
8           Tom    Karachi      Charger         3     10
9          Sana     Lahore  Smart Watch         1     80

In [5]:
df["Total Price"]=df["Price"]*df["Quantity"]

In [6]:
df

  Customer_Name       City      Product  Quantity  Price  Total Price
0           Ali    Karachi       Laptop         2   1200         2400
1        Mariam     Lahore       Mobile         1    300          300
2         Usman     Multan     Keyboard         3     30           90
3           Tom  Islamabad      Charger         1     10           10
4          Sana    Karachi  Smart Watch         2     80          160
5           Ali     Lahore       Laptop         1   1200         1200
6        Mariam     Multan       Mobile         2    300          600
7         Usman  Islamabad     Keyboard         1     30           30
8           Tom    Karachi      Charger         3     10           30
9          Sana     Lahore  Smart Watch         1     80           80

In [7]:
df.groupby("Customer_Name")["Quantity"].sum()

Customer_Name
Ali       3
Mariam    3
Sana      3
Tom       4
Usman     4
Name: Quantity, dtype: int64

In [12]:
df.groupby("Customer_Name")["Total Price"].sum()

Customer_Name
Ali       3600
Mariam     900
Sana       240
Tom         40
Usman      120
Name: Total Price, dtype: int64

In [13]:
df.groupby("Product")["Total Price"].sum()

Product
Charger          40
Keyboard        120
Laptop         3600
Mobile          900
Smart Watch     240
Name: Total Price, dtype: int64

In [15]:
df.groupby("Product")["Quantity"].mean()

Product
Charger        2.0
Keyboard       2.0
Laptop         1.5
Mobile         1.5
Smart Watch    1.5
Name: Quantity, dtype: float64

In [16]:
df.groupby("City")["Total Price"].sum()

City
Islamabad      40
Karachi      2590
Lahore       1580
Multan        690
Name: Total Price, dtype: int64

In [19]:
df.groupby(["Customer_Name","Product"])["Quantity"].sum()

Customer_Name  Product
Ali            Laptop         3
Mariam         Mobile         3
Sana           Smart Watch    3
Tom            Charger        4
Usman          Keyboard       4
Name: Quantity, dtype: int64

In [21]:
df.groupby(["City","Product"])["Total Price"].sum()

City       Product
Islamabad  Charger          10
           Keyboard         30
Karachi    Charger          30
           Laptop         2400
           Smart Watch     160
Lahore     Laptop         1200
           Mobile          300
           Smart Watch      80
Multan     Keyboard         90
           Mobile          600
Name: Total Price, dtype: int64

In [26]:
df.groupby("Customer_Name")["Total Price"].max()

Customer_Name
Ali       2400
Mariam     600
Sana       160
Tom         30
Usman       90
Name: Total Price, dtype: int64

In [28]:
df.groupby("City")["Product"].count()

City
Islamabad    2
Karachi      3
Lahore       3
Multan       2
Name: Product, dtype: int64

In [31]:
df.groupby("City")["Price"].mean()

City
Islamabad     20.000000
Karachi      430.000000
Lahore       526.666667
Multan       165.000000
Name: Price, dtype: float64

In [32]:
df.groupby("Product")["Price"].max()

Product
Charger          10
Keyboard         30
Laptop         1200
Mobile          300
Smart Watch      80
Name: Price, dtype: int64

In [33]:
df.groupby("Customer_Name")["Quantity"].min()

Customer_Name
Ali       1
Mariam    1
Sana      1
Tom       1
Usman     1
Name: Quantity, dtype: int64